{
  "metadata": {
    "timestamp": "2025-10-24T17:20:31.592Z",
    "collectionsCount": 5,
    "documentsCount": 24,
    "projectId": "projectdbclass"
  },
  "data": {
    "Questions": [
      {
        "id": 1,
        "title": "Number of papers with an empirical study per year",
        "uid": "query_1",
        "dataAnalysisInformation": {
          "dataInterpretation": "<p>Based on the figure and the following table, we observe a clear increasing trend in the proportion of papers with an empirical studiy over time. The average proportion of papers with an empirical study increased steadily over the decades.</p>\n\n<style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-c3ow{border-color:inherit;text-align:center;vertical-align:top}\n.tg .tg-7btt{border-color:inherit;font-weight:bold;text-align:center;vertical-align:center}\n.tg .tg-0pky{border-color:inherit;text-align:left;vertical-align:top}\n</style>\n<table class=\"tg\">\n<thead>\n<tr>\n<th class=\"tg-7btt\">Timeframe</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td class=\"tg-c3ow\">1993-1999</td>\n<td class=\"tg-c3ow\">48.6</td>\n<td class=\"tg-c3ow\">33-74</td>\n</tr>\n<tr>\n<td class=\"tg-c3ow\">2000-2009</td>\n<td class=\"tg-c3ow\">69.2</td>\n<td class=\"tg-c3ow\">59-86</td>\n</tr>\n<tr>\n<td class=\"tg-c3ow\">2010-2019</td>\n<td class=\"tg-c3ow\">85.2</td>\n<td class=\"tg-c3ow\">63-100</td>\n</tr>\n<tr>\n<td class=\"tg-c3ow\">2020-2025</td>\n<td class=\"tg-c3ow\">95.0</td>\n<td class=\"tg-c3ow\">88-100</td>\n</tr>\n</tbody>\n</table>\n<p>While the <strong>“current” state of practice (2007)</strong> shows an average proportion of papers with an empirical study of 79.0%, the proportion of papers with an empirical study in the <strong>target state (2020–2025)</strong> is consistently high (above 88.0%), with an average value of 95.0%. The data supports the change predicted by <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, meaning that the envisioned <strong>target state (2020–2025)</strong> has been achieved, as empirical studies have become the standard rather than the exception in empirical research in RE in recent years.</p>",
          "dataAnalysis": "For this data analysis, we select all papers that have an empirical study according to our definition (data collection and data analysis). For this reason, we remove all papers that have \"no collection\" and/or \"no analysis\". In addition, a paper can involve more than one empirical method for data collection and data analysis so that we must exclude duplicate papers. In this way, we can determine the number of all unique papers. For more detailed insights, we normalize the number of all papers with an empirical study based on the number of all unique papers per year, as the total number of papers per year varies.",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>, \n  the <strong>\"current\" state of practice (2007)</strong> shows that there are relatively \n  <strong>few empirical studies</strong>. For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> envision \n  a <strong>large number of studies</strong>. This predicted change from a few to a large number of \n  empirical studies leads to the corresponding competency question.\n</p>",
          "requiredDataForAnalysis": "<p>We must retrieve all papers with their publication year that use our ORKG template and report an empirical study. However, we need to define what we mean by an empirical study. According to <a href=\"https://www.springer.com/journal/10664\">Empirical Software Engineering Journal</a>, &quot;<em>Empirical studies presented here usually involve the collection and analysis of data and experience...</em>&quot;. For this reason, we define that an empirical study is a study that includes data analysis as a necessary condition to be a study (<em>Necessity</em>) and data collection as a sufficient condition to be an empirical study (<em>Sufficiency</em>). Thus, a study must always include data analysis and an empirical study must include data collection and data analysis. We do not consider the mere reporting of a data collection as a study or even an empirical study.</p>",
          "question": "How has the proportion of empirical studies evolved over time?"
        }
      },
      {
        "id": 10,
        "title": "Number of papers per year",
        "dataAnalysisInformation": {
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, \n  one may question the <strong>industrial relevance of most of the studies</strong> in the \n  <strong>\"current\" state of practice (2007)</strong>. \n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that researchers carry out \n  <strong>more case studies and action research</strong>. \n  This predicted change leads to the corresponding competency question.\n</p>",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and report on the use of the empirical methods: case studies and action research.",
          "question": "How have the proportions of case studies and action research in the empirical methods used evolved over time?",
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of case studies and action research used for data collection per year\", we observe the following trends for case studies and action research used as empirical methods for data collection.\n</p>\n\n<ol>\n  <li>\n    The proportion of <em>case studies</em> decreases over time. We assume this change is a result of a clear definition of the term. \n    According to <a href=\"https://doi.org/10.1016/j.infsof.2021.106514\">Wohlin</a>, the term case study is often misused in software engineering research. \n    Based on the manual curation of the 570 papers, we can confirm this finding. Prior to 2013, we found many papers that use the term case study \n    (with an average proportion of 53.2% of all analyzed papers with a data collection), although at best they report an experiment or a larger use case \n    in the sense of an application example. Despite the decrease, this finding represents a positive development of the empirical research in RE \n    as researchers appear to be more aware of how a case study is defined.\n  </li>\n  <li>\n    The proportion of <em>action research</em> is constantly low over the entire analyzed timeframe (2000–2022). In all years analyzed, \n    the proportion of action research is at most 10% of the respective papers, with an overall average proportion of only 2%. \n    Furthermore, as of 2018, there is no publication using action research.\n  </li>\n</ol>\n\n<p>\n  For the <strong>target state (2020–2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that researchers carry out more case studies and action research. \n  Regarding <em>case study</em>, we observe a decrease over time, and <em>action research</em> is rarely used overall. \n  For these reasons, the envisioned use of case studies and action research is not yet achieved. \n  While action research is fundamentally used very little over the entire analyzed timeframe (2000–2022), we even observe a decrease in the use of case studies. \n  Although the latter does not fundamentally help achieve the vision of \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, we believe this change nonetheless represents a positive development \n  in empirical research in RE, as researchers appear to be more aware of how a case study is defined.\n</p>",
          "dataAnalysis": "For this data analysis, we consider all papers that report on the use of the empirical methods: case study and action research. A paper can involve more than one empirical method for data collection so that the number of empirical methods can be larger than the number of papers. We normalize the number of empirical methods (case study and action research) used based on the number of all unique papers with data collection per year."
        },
        "uid": "query_10"
      },
      {
        "id": 11,
        "uid": "query_11",
        "dataAnalysisInformation": {
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of papers that provide at least one URL to data per year\", an increasing proportion of papers that provide at least one URL to data can be observed over time. \n  While before 2010 the average proportion of papers that provide at least one URL to data is 25.4%, the average proportion for the period 2010–2019 is 49.8%. \n  For the <strong>target state (2020–2025)</strong>, the average proportion of papers that provide at least one URL to data is 71.3%. \n  Based on these data, we observe a positive development towards the vision of \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> that the envisioned increase in \n  <strong>more research studies</strong> providing results, materials, and raw data that enable efficient cumulative research can be achieved.\n</p>",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, the \n  <strong>\"current\" state of practice (2007)</strong> shows that <strong>few studies</strong> provide results, materials, and raw data \n  that enable efficient cumulative research. For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that \n  <strong>more research studies</strong> are designed with the goal of enabling efficient use of their results by other researchers. \n  This predicted change leads to the corresponding competency question.\n</p>",
          "dataAnalysis": "For this data analysis, we consider all papers that provide at least one url for the availiability of the materials used, raw data collected, and study results. A paper can involve more than one url for the data. For this reason, we determine the number of papers that provide at least one url and we normalize the number of papers with at least one url based on the number of all unique papers with data collection per year.",
          "question": "How has the provision of data (the materials used, raw data collected, and study results identified) evolved over time?",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and provide at least one url for the availiability of the materials used, raw data collected, and study results."
        },
        "title": "Number of papers per year"
      },
      {
        "id": 12,
        "uid": "query_12",
        "dataAnalysisInformation": {
          "question": "How has the reporting of research questions and answers evolved over time?",
          "dataAnalysis": "For this data analysis, we consider all papers that report at least one research question (either highlighted or hidden). We also assume that all papers provide an answer (highlighted or hidden) in some way as they are published research paper. A paper can involve more than one research question so that the number of research questions can be larger than the number of papers. We normalize the number of papers with hightlighted/hidden research question(s) and anwers based on the number of all unique papers per year.",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, the \n  <strong>\"current\" state of practice (2007)</strong> shows that <strong>results are hidden</strong>. \n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that researchers \n  <strong>focus more on communicating important results</strong>, such as the research question and its answer. \n  This predicted change leads to the corresponding competency question.\n</p>",
          "dataInterpretation": "<p>\n  In the figure \"Normalized number of papers highlighting/hiding research question(s) and answers per year grouped by highlighting/hiding combination\", \n  we see the development trend for all four combinations of highlighted/hidden research question(s) and answers pairs:\n</p>\n\n<ol>\n  <li>\n    The proportion of papers with highlighted research question(s) and highlighted answers is overall rather low, with an average proportion of only 7.7%. \n    For 2022, however, we observe a fivefold increase in the proportion of papers highlighting their research question(s) and answers. \n    Although the overall average proportion is low, the development is positive as researchers focus more on communicating (highlighting) their results.\n  </li>\n  <li>\n    The proportion of papers with highlighted research question(s) and answers hidden in the running text is overall high, with an average proportion of 25.7%. \n    We observe a constant increase of this proportion of papers over the years, with its current maximum of 61% in 2021, which can be partly interpreted positively. \n    While researchers highlight their research question(s) as one important element of their paper, they hide the associated answer in the running text. \n    As a consequence, the reader has to find the answer to the research question in the paper himself, which makes it difficult to get a quick and easy overview of the paper with its central results.\n  </li>\n  <li>\n    The proportion of papers with research question(s) hidden in the running text and highlighted answers is very low, with only 4% in 2011, \n    which corresponds to one paper. Based on our manual curation, we can report that this paper is a special case, as the authors failed to formulate \n    their research questions as questions and instead offer only a bullet point list of aspects to be investigated.\n  </li>\n  <li>\n    The proportion of papers with research question(s) and answers hidden in the running text is overall low, with an average proportion of 10%. \n    While the proportion increases slightly until 2018, we observe that from 2019 to 2022 the proportion is at a maximum of 6%. \n    In particular, for the <strong>target state (2020 - 2025)</strong>, the average percentage is only 5%, which means that a small number of papers hide \n    their research question(s) and answers in the running text and thus, conversely, more researchers make an effort to visibly communicate their important findings.\n  </li>\n</ol>\n\n<p>\n  In the figure \"Normalized number of papers without research question(s) and highlighted/hidden answers per year grouped by highlighted/hidden answer\", \n  we see the development trend of papers without a research question and highlighted or hidden answers:\n</p>\n\n<ol>\n  <li>\n    The proportion of papers without a research question and a highlighted answer is always 0%, \n    which means that researchers who do not pose a research question also do not highlight any results as an answer to the problem under study.\n  </li>\n  <li>\n    The proportion of papers without a research question and a hidden answer is decreasing over the years, but has an average proportion of 56.4%. \n    However, from 2018 until 2022 the proportion is again decreasing, with its current smallest value of 12% in 2022.\n  </li>\n</ol>\n\n<p>\n  Based on these results, we observe a positive development towards the vision of \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> as researchers focus more on communicating (highlighting) \n  the important results of their research, as envisioned.\n</p>",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and have information about the research questions and answer.\n"
        },
        "title": "Number of papers per year"
      },
      {
        "id": 13,
        "dataAnalysisInformation": {
          "question": "What empirical methods are used to conduct integrative and interpretive (systematic literature) reviews, so-called secondary research?",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, the \n  <strong>\"current\" state of practice (2007)</strong> shows that (literature) <strong>reviews</strong>, so-called secondary research, are mainly \n  <strong>narrative and biased</strong>, and researchers have <strong>little appreciation of the value of systematic (literature) reviews</strong>. \n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that \n  <strong>scientific methods are used to undertake integrative and interpretive (literature) reviews</strong>. \n  This predicted change leads to the corresponding competency question.\n</p>",
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of empirical methods used for secondary research\", we observe that mainly three empirical methods are used for secondary research. \n  These three methods are <em>archive analysis</em> (59% proportion), <em>literature review</em> (14% proportion), and <em>systematic literature reviews</em> (14% proportion). \n  In addition, we found seven other methods based on the extracted names whose proportion is below 3%. \n  <em>Archive analysis</em> is the most frequently used method for secondary research. \n  This method includes all types of analyses based on archived data, such as data from issue trackers, app stores, forums, or Twitter. \n  The next two most commonly used methods are literature review and systematic literature reviews, which are probably the best-known methods of secondary research.\n</p>\n\n<p>\n  Overall, the results show researchers use a <strong>larger set of research methods and techniques</strong>. \n  In particular, there are essentially six different methods used for data collection and three different methods used for data analysis. \n  However, the proportion of <em>action research</em> for data collection and especially <em>inferential statistics</em> for data analysis is very low.\n</p>",
          "requiredDataForAnalysis": "We must retrieve all papers that use our ORKG template and secondardy research as the empirical method for data collection.",
          "dataAnalysis": "For this data analysis, we consider all papers that that use our ORKG template and secondardy research as the empirical method for data collection. From these papers, we extract the empirical methods used for secondary research. We normalize the number of papers using empirical mehtods for secondary research based on the number of all papers that use secondary research for data collection."
        },
        "uid": "query_13",
        "title": "Number of papers per year"
      },
      {
        "id": 14,
        "dataAnalysisInformation": {
          "dataAnalysis": "For this data analysis, we consider all papers that that use our ORKG template and secondardy research as the empirical method for data collection. From these papers, we extract the empirical methods used for secondary research. We normalize the number of papers using empirical mehtods for secondary research based on the number of all papers that use secondary research for data collection.",
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of empirical methods used for secondary research per year grouped by method\", \n  we observe that mainly three empirical methods are used for secondary research. \n  These three methods are <em>archive analysis</em> (59% proportion), <em>literature review</em> (14% proportion), and \n  <em>systematic literature reviews</em> (14% proportion). In addition, we found seven other methods based on the extracted names whose proportion is below 3%. \n  In addition to the frequent use of <em>archive analysis</em> over the years, it can be observed that from 2008 onwards researchers perform literature reviews \n  and systematic literature reviews with increasing frequency. In particular, for the <strong>target state (2020 - 2025)</strong>, \n  the average proportion of papers with systematic literature reviews is 45.5%.\n</p>\n\n<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, the \n  <strong>\"current\" state of practice (2007)</strong> shows that (literature) <strong>reviews</strong>, so-called secondary research, are mainly \n  <strong>narrative and biased</strong>, and researchers have <strong>little appreciation of the value of systematic (literature) reviews</strong>. \n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that \n  <strong>scientific methods are used to undertake integrative and interpretive (literature) reviews</strong>. \n  This predicted change leads to the corresponding competency question.\n</p>\n\n<p>\n  Based on these results, we observe a positive development towards the vision of \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> that a greater appreciation of the value of systematic (literature) reviews \n  as envisioned for the <strong>target state (2020 - 2025)</strong> can be achieved.\n</p>",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, the \n  <strong>\"current\" state of practice (2007)</strong> shows that (literature) <strong>reviews</strong>, so-called secondary research, are mainly \n  <strong>narrative and biased</strong>, and researchers have <strong>little appreciation of the value of systematic (literature) reviews</strong>. \n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that \n  <strong>scientific methods are used to undertake integrative and interpretive (literature) reviews</strong>. \n  This predicted change leads to the corresponding competency question.\n</p>",
          "question": "How has the proportions of empirical methods to conduct (systematic literature) reviews, so-called secondary research, evolved over time?",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and secondardy research as the empirical method for data collection."
        },
        "title": "Number of papers per year",
        "uid": "query_14"
      },
      {
        "id": 15,
        "title": "Number of papers per year",
        "uid": "query_15_1",
        "dataAnalysisInformation": {
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, the \n  <strong>\"current\" state of practice (2007)</strong> shows that there is <strong>limited</strong> advice on how to \n  <strong>combine data from diverse study types</strong>. \n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that \n  <strong>methods are available</strong> for synthesizing evidence from <strong>variety of perspectives and approaches</strong>. \n  This predicted change leads to the corresponding competency question.\n</p>",
          "dataAnalysis": "For this data analysis, we consider all papers that that use our ORKG template and secondardy research as the empirical method for data collection. From these papers, we extract the empirical methods used for secondary research. We normalize the number of papers using empirical mehtods for secondary research based on the number of all papers that use secondary research for data collection.",
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of papers using X empirical methods for data collection and data analysis\", \n  we observe that papers use one to twelve empirical methods for data collection and analysis. \n  Most papers use three (31.3% proportion) to four (21.6% proportion) empirical methods. \n  The use of three or more methods in one paper requires the need for methods to synthesize evidence from \n  <strong>variety of perspectives and approaches</strong> as envisioned by \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>. \n  Based on our data, we cannot say whether such methods for synthesizing evidence are already available for the \n  <strong>target state (2020 - 2025)</strong> as envisioned. \n  However, our results imply, based on the increased number of methods used per paper, that there is such a need for methods to synthesize evidence.\n</p>",
          "question": "How many different research methods are used per publication?",
          "requiredDataForAnalysis": "<p>\n  We must retrieve all papers that use our ORKG template and report on the use of empirical methods. \n  According to <a href=\"https://doi.org/10.1002/9781118901731.iecrm0083\">Dan (2017)</a>, empirical methods include data collection and data analysis. \n  An empirical method can therefore be a method for data collection and data analysis. \n  For this reason, we identify the number of empirical methods used for data collection and data analysis respectively. \n  Based on the individual paper, we can determine the sum of all empirical methods per publication.\n</p>"
        }
      },
      {
        "id": 16,
        "uid": "query_16_1",
        "title": "Number of papers using X empirical methods per year",
        "dataAnalysisInformation": {
          "requiredDataForAnalysis": "<p>\n  We must retrieve all papers that use our ORKG template and report on the use of empirical methods. According to <a href=\"https://doi.org/10.1002/9781118901731.iecrm0083\" target=\"_blank\">Dan (2017)</a>, empirical methods include data collection and data analysis. An empirical method can therefore be a method for data collection and data analysis. For this reason, we identify the number of empirical methods used for data collection and data analysis respectively. Based on the individual paper, we can determine the sum of all empirical methods per publication.\n</p>",
          "dataAnalysis": "<p>\n  For this data analysis, we consider all papers that use our ORKG template and \n  <strong>secondary research</strong> as the empirical method for data collection. \n  From these papers, we extract the empirical methods used for secondary research. \n  We normalize the number of papers using empirical methods for secondary research \n  based on the number of all papers that use secondary research for data collection.\n</p>",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>, the <strong>\"current\" state of practice (2007)</strong> shows that there is <strong>limited</strong> advice on how to <strong>combine data from diverse study types</strong>. For the <strong>target state (2020 - 2025)</strong>, <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> envision that <strong>methods are available</strong> for synthesizing evidence from <strong>variety of perspectives and approaches</strong>. This predicted change leads to the corresponding competency question.\n</p>",
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of papers using X empirical methods for data collection and data analysis per year grouped by number of empirical methods\", we observe that the proportion of papers using only one or two empirical methods for data collection and data analysis steadily decreases over time. In contrast, we observe a steady increase in the use of three or more empirical methods for data collection and data analysis over time. In particular, from 2016 onwards, researchers often use four or even five different empirical methods. Based on these results, we observe a positive development towards the vision of <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>. Researchers combine data using different methods for data collection and data analysis. Based on our data, we cannot say whether corresponding methods for synthesizing evidence are already available for the <strong>target state (2020 - 2025)</strong> as envisioned. However, our results indicate that there is a need for methods to synthesize findings due to the increase in the number of methods used per paper in recent years.\n</p>",
          "question": "How has the number of research methods used per publication evolved over time?"
        }
      },
      {
        "id": 2,
        "uid": "query_2_1",
        "dataAnalysisInformation": {
          "dataAnalysis": [
            "For this data analysis, we consider the empirical methods used for data collection. We identify the empirical methods used for data collection. A paper can involve more than one empirical method for data collection so that the number of empirical methods can be larger than the number of papers. In addition, the number of papers per year varies. For this reason, we normalize the number of empirical methods used based on the number of all unique papers per year.",
            "For this data analysis, we consider the empirical methods used for data analysis. We identify the empirical methods used for data analysis. A paper can involve more than one empirical method for data analysis so that the number of empirical methods can be larger than the number of papers. In addition, the number of papers per year varies. For this reason, we normalize the number of empirical methods used based on the number of all unique papers per year."
          ],
          "dataInterpretation": [
            "<p>Based on the figure and the following table, we observe that seven empirical methods are used for data collection. These seven methods are <em>case study</em> (242  times), <em>experiment</em> (155 times), <em>survey</em> (116 times), <em>secondary research</em> (116 times), <em>interview</em> (110 times), <em>action research</em> (10 times), and <em>other methods</em> as a default category (229 times).</p>\n<p><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-c3ow{border-color:inherit;text-align:center;vertical-align:top}\n.tg .tg-7btt{border-color:inherit;font-weight:bold;text-align:center;vertical-align:center}\n.tg .tg-0pky{border-color:inherit;text-align:left;vertical-align:top}\n</style></p>\n<table class=\"tg\">\n<thead>\n<tr>\n<th class=\"tg-7btt\" rowspan=\"2\">Timeframe</th>\n<th class=\"tg-7btt\" colspan=\"2\">Case study</th>\n<th class=\"tg-7btt\" colspan=\"2\">Experiment</th>\n<th class=\"tg-7btt\" colspan=\"2\">Survey</th>\n<th class=\"tg-7btt\" colspan=\"2\">Interview</th>\n<th class=\"tg-7btt\" colspan=\"2\">Secondary research</th>\n<th class=\"tg-7btt\" colspan=\"2\">Action research</th>\n<th class=\"tg-7btt\" colspan=\"2\">Other methods</th>\n</tr>\n<tr>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td class=\"tg-0pky\">1993-1999</td>\n<td class=\"tg-c3ow\">50.6</td>\n<td class=\"tg-c3ow\">12-78</td>\n<td class=\"tg-c3ow\">9.1</td>\n<td class=\"tg-c3ow\">0-21</td>\n<td class=\"tg-c3ow\">11.6</td>\n<td class=\"tg-c3ow\">0-23</td>\n<td class=\"tg-c3ow\">14.3</td>\n<td class=\"tg-c3ow\">0-33</td>\n<td class=\"tg-c3ow\">12.1</td>\n<td class=\"tg-c3ow\">0-30</td>\n<td class=\"tg-c3ow\">0.0</td>\n<td class=\"tg-c3ow\">0</td>\n<td class=\"tg-c3ow\">45.3</td>\n<td class=\"tg-c3ow\">11-75</td>\n</tr>\n<tr>\n<td class=\"tg-0pky\">2000-2009</td>\n<td class=\"tg-c3ow\">53.0</td>\n<td class=\"tg-c3ow\">44-67</td>\n<td class=\"tg-c3ow\">16.0</td>\n<td class=\"tg-c3ow\">0-39</td>\n<td class=\"tg-c3ow\">14.0</td>\n<td class=\"tg-c3ow\">0-28</td>\n<td class=\"tg-c3ow\">12.9</td>\n<td class=\"tg-c3ow\">0-25</td>\n<td class=\"tg-c3ow\">11.5</td>\n<td class=\"tg-c3ow\">5-17</td>\n<td class=\"tg-c3ow\">3.0</td>\n<td class=\"tg-c3ow\">0-10</td>\n<td class=\"tg-c3ow\">35.9</td>\n<td class=\"tg-c3ow\">6-88</td>\n</tr>\n<tr>\n<td class=\"tg-0pky\">2010-2019</td>\n<td class=\"tg-c3ow\">34.1</td>\n<td class=\"tg-c3ow\">6-53</td>\n<td class=\"tg-c3ow\">36.4</td>\n<td class=\"tg-c3ow\">21-56</td>\n<td class=\"tg-c3ow\">21.0</td>\n<td class=\"tg-c3ow\">11-35</td>\n<td class=\"tg-c3ow\">20.7</td>\n<td class=\"tg-c3ow\">4-38</td>\n<td class=\"tg-c3ow\">17.0</td>\n<td class=\"tg-c3ow\">0-29</td>\n<td class=\"tg-c3ow\">1.6</td>\n<td class=\"tg-c3ow\">0-5</td>\n<td class=\"tg-c3ow\">33.4</td>\n<td class=\"tg-c3ow\">11-59</td>\n</tr>\n<tr>\n<td class=\"tg-0pky\">2020-2025</td>\n<td class=\"tg-c3ow\">20.5</td>\n<td class=\"tg-c3ow\">12-40</td>\n<td class=\"tg-c3ow\">34.8</td>\n<td class=\"tg-c3ow\">15-57</td>\n<td class=\"tg-c3ow\">25.8</td>\n<td class=\"tg-c3ow\">14-43</td>\n<td class=\"tg-c3ow\">21.5</td>\n<td class=\"tg-c3ow\">14-29</td>\n<td class=\"tg-c3ow\">41.5</td>\n<td class=\"tg-c3ow\">35-50</td>\n<td class=\"tg-c3ow\">0.0</td>\n<td class=\"tg-c3ow\">0</td>\n<td class=\"tg-c3ow\">33.0</td>\n<td class=\"tg-c3ow\">21-55</td>\n</tr>\n</tbody>\n</table>\n\n<p>First, we will briefly summarize our observations for each empirical method before looking at the data as a whole.</p>\n<p>1) <em>Case study</em>: Over the years, case studies are the dominant empirical method, especially in the early period, peaking at 78.0% in 1996. However, their use declines steadily after 2012. For the <strong>&quot;current&quot; state of practice (2007)</strong>, case studies are still the most common empirical method overall, used in 54.0% of papers analyzed, but their dominance is already decreasing. For the <strong>target state (2020 - 2025)</strong>, the average proportion of case studies drops significantly to 20.5%, indicating a major shift away from this method toward other empirical methods. We assume this change is a result of a clear definition of the term case study. According to <a href=\"https://doi.org/10.1016/j.infsof.2021.106514\">Wohlin</a>, the term case study is often misused in software engineering research. Based on the manual curation of the 776 papers, we can confirm this finding. Prior to 2013, we found many papers that use the term case study (with an average proportion of 51.9%), although at best they report an experiment or a larger use case in the sense of an application example. Despite the decrease, this finding represents a positive development of the empirical research in RE as researchers appear to be more aware of how a case study is defined.</p>\n<p>2) <em>Experiment</em>: Experiments show a gradual increase in popularity over time, becoming more widely used after 2007. For the <strong>&quot;current&quot; state of practice (2007)</strong>, experiments are only used in 8.0% of papers analyzed, reflecting low adoption. Their use peaked at 57.0% in 2022, demonstrating a growing interest in this empirical method. For the <strong>target state (2020 - 2025)</strong>, experiments are established as a key method, with an average proportion of 34.8%, highlighting their enduring importance in empirical research in RE.</p>\n<p>3) <em>Survey</em>: Surveys maintained a relatively stable throughout the years, with minor fluctuations. For the <strong>&quot;current&quot; state of practice (2007)</strong>, they were used in only 8.0% of the papers analyzed, indicating limited adoption at the time. However, their use increased steadily in recent years, reaching an average proportion of 25.8% for the <strong>target state (2020 - 2025)</strong>. This suggests a growing preference for structured data collection through surveys, reflecting their consistent role in empirical research in RE.</p>\n<p>4) <em>Interview</em>: Interviews gained traction over time, particularly after 2010. For the <strong>&quot;current&quot; state of practice (2007)</strong>, interviews were used in 25.0% of papers analyzed, showing moderate adoption. For the <strong>target state (2020 - 2025)</strong>, their use remains constant with an average proportion of 21.5%, indicating stable use in empirical research in RE.</p>\n<p>5) <em>Secondary research</em>: Secondary research, including all kinds of literature reviews and archive analysis, show a clear rise from 2015 onward, becoming one of the most popular empicial methods by 2022. For the <strong>&quot;current&quot; state of practice (2007)</strong>, it was rarely used, with an proportion of just 12.0%. However, its use surged in the <strong>target state (2020 - 2025)</strong> with an average proportion of 41.5% and its peak at 50.0% in 2022. This trend highlights the increasing value of analyzing existing data in empirical research in RE.</p>\n<p>6) <em>Action research</em>: Action research remains consistently low throughout the entire analyzed timeframe (1993-2025). For the <strong>&quot;current&quot; state of practice (2007)</strong>, it was used with a proportion of 8.0%. After 2017, and thus also for the <strong>target state (2020 - 2025)</strong>, there is no paper using action research. It remains a niche method, indicating limited adoption in empirical research in RE.</p>\n<p>7) <em>Other methods</em>: This category is the default category covering all empirical methods that do not belong to one of the other six categories. The use of other methods varied significantly over the years, peaking at 88.0% in 2005 and showing an overall average proportion of 36.9%. Given that more than a third of the papers analyzed use other methods, a more detailed analysis of this category is necessary in the future.</p>\n<p>Looking at the data as a whole, we observe a clear shift towards a more diverse and balanced use of empirical methods for data collection, as envisioned by <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>. While the <strong>&quot;current&quot; state of practice (2007)</strong> shows limited diversity of empirical methods, the <strong>target state (2020 - 2025)</strong> reflects a significant diversification of empirical methods used for empirical research in RE. The decline in the dominance of case studies and the rise in experiments, surveys, interviews, and secondary research indicate a broader adoption of various empirical methods for data collection in recent years.</p>",
            "<p>Based on the figure and the following table, we observe that four empirical methods are used for data analysis. These four methods are <em>descriptive statistic</em> (671 times), <em>inferential statistic</em> (125 times), <em>machine learning</em> (153 times), and <em>other methods</em> as a default category (579 times).</p>\n<p><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-c3ow{border-color:inherit;text-align:center;vertical-align:top}\n.tg .tg-7btt{border-color:inherit;font-weight:bold;text-align:center;vertical-align:center}\n.tg .tg-0pky{border-color:inherit;text-align:left;vertical-align:top}\n</style></p>\n<table class=\"tg\"><thead>\n  <tr>\n    <th class=\"tg-7btt\" rowspan=\"2\">Timeframe</th>\n    <th class=\"tg-7btt\" colspan=\"2\">Descriptive statistics</th>\n    <th class=\"tg-7btt\" colspan=\"2\">Inferential statistics</th>\n    <th class=\"tg-7btt\" colspan=\"2\">Machine learning</th>\n    <th class=\"tg-7btt\" colspan=\"2\">Other methods</th>\n  </tr>\n  <tr>\n    <th class=\"tg-7btt\">Avg. proportion [%]</th>\n    <th class=\"tg-7btt\">Range [%]</th>\n    <th class=\"tg-7btt\">Avg. proportion [%]</th>\n    <th class=\"tg-7btt\">Range [%]</th>\n    <th class=\"tg-7btt\">Avg. proportion [%]</th>\n    <th class=\"tg-7btt\">Range [%]</th>\n    <th class=\"tg-7btt\">Avg. proportion [%]</th>\n    <th class=\"tg-7btt\">Range [%]</th>\n  </tr></thead>\n<tbody>\n  <tr>\n    <td class=\"tg-0pky\">1993-1999</td>\n    <td class=\"tg-c3ow\">68.3</td>\n    <td class=\"tg-c3ow\">50-83</td>\n    <td class=\"tg-c3ow\">6.9</td>\n    <td class=\"tg-c3ow\">0-18</td>\n    <td class=\"tg-c3ow\">1.3</td>\n    <td class=\"tg-c3ow\">0-9</td>\n    <td class=\"tg-c3ow\">84.3</td>\n    <td class=\"tg-c3ow\">73-92</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">2000-2009</td>\n    <td class=\"tg-c3ow\">80.4</td>\n    <td class=\"tg-c3ow\">53-94</td>\n    <td class=\"tg-c3ow\">11.4</td>\n    <td class=\"tg-c3ow\">6-25</td>\n    <td class=\"tg-c3ow\">8.3</td>\n    <td class=\"tg-c3ow\">0-15</td>\n    <td class=\"tg-c3ow\">70.4</td>\n    <td class=\"tg-c3ow\">38-88</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">2010-2019</td>\n    <td class=\"tg-c3ow\">93.4</td>\n    <td class=\"tg-c3ow\">89-100</td>\n    <td class=\"tg-c3ow\">24.8</td>\n    <td class=\"tg-c3ow\">11-40</td>\n    <td class=\"tg-c3ow\">25.4</td>\n    <td class=\"tg-c3ow\">11-56</td>\n    <td class=\"tg-c3ow\">48.6</td>\n    <td class=\"tg-c3ow\">35-68</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">2020-2025</td>\n    <td class=\"tg-c3ow\">96.0</td>\n    <td class=\"tg-c3ow\">83-100</td>\n    <td class=\"tg-c3ow\">22.3</td>\n    <td class=\"tg-c3ow\">6-36</td>\n    <td class=\"tg-c3ow\">41.7</td>\n    <td class=\"tg-c3ow\">26-58</td>\n    <td class=\"tg-c3ow\">72.5</td>\n    <td class=\"tg-c3ow\">36-87</td>\n  </tr>\n</tbody></table>\n\n<p>First, we will briefly summarize our observations for each empirical method before looking at the data as a whole.</p>\n<p>1) <em>Descriptive statistic</em>: Descriptive statistics are consistently the most widely used empirical method for data analysis, starting already with an average proportion of 68.3% in 1993-1999 and steadily increasing. For the <strong>&quot;current&quot; state of practice (2007)</strong>, they are already a dominant approach, with a proportion of 83.0%, reflecting their foundational role in data analysis. For the <strong>target state (2020 - 2025)</strong>, their usage remains robust and even further increasing to an average proportion of 95.0%, underscoring their continued importance in empirical research in RE.</p>\n<p>2) <em>Inferential statistic: The use of inferential statistics shows a gradual but steady increase over time. For the <strong>&quot;current&quot; state of practice (2007)</strong>, their adoption was relatively low at 13.0%, indicating limited use in empirical studies. However, for the <em>*target state (2020 - 2025)</em></em>, there is a notable rise, reaching an average proportion of 22.3%, which highlights a growing recognition of their value in data analysis.</p>\n<p>3) <em>Machine learning</em>: Machine learning methods, including all types of artificial intelligence approaches (to be revised in the future), have experienced a clear increase in popularity, particularly from 2010 onwards. Starting with an average proportion of 1.3% in 1993-1999, their usage peaked at 58.0% in 2020. For the <strong>&quot;current&quot; state of practice (2007)</strong>, their adoption was low at 9.0%, reflecting early-stage exploration. The <strong>target state (2020 - 2025)</strong> marks a significant shift, with machine learning methods becoming a major empirical method with an average proportion of 41.7%.</p>\n<p>4) <em>Other methods</em>: This category is the default category covering all empirical methods that do not belong to one of the other three categories. The use of other methods varied significantly over the years, peaking at 92.0% in 1998 and showing an overall average proportion of 70%%. Based on the manual analysis of the 776 papers, we can report that these other methods include various types of coding as qualitative analysis method. Given that almost three-quarters of the papers analyzed use other methods, a more detailed analysis of this category is necessary in the future.</p>\n<p>Looking at the data as a whole, it supports the vision by <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>. The <strong>&quot;current&quot; state of practice (2007)</strong> was characterized by a dominance of descriptive statistics and relatively few empirical studies using other methods. However, the <strong>target state (2020 - 2025)</strong> shows a substantial increase in the use of diverse empirical methods for data analysis.</p>"
          ],
          "requiredDataForAnalysis": "<p>\n  We must retrieve all papers with their publication year that use our ORKG template and report on the use of empirical methods. According to \n  <a href=\"https://doi.org/10.1002/9781118901731.iecrm0083\" target=\"_blank\">Dan (2017)</a>, empirical methods include data collection and data analysis. \n  An empirical method can therefore be a method for data collection and data analysis. We consider the empirical method used for data collection or \n  data analysis respectively, as our template allows for a correspondingly more fine-grained analysis.\n</p>",
          "question": "How often are which empirical methods used over time?",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>, the <strong>\"current\" state of practice (2007)</strong> shows that there are relatively <strong>few empirical studies</strong>. For the <strong>target state (2020 - 2025)</strong>, <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> envision a <strong>large number of studies [...] using different empirical methods</strong>. This predicted change from a few to a large number of empirical studies using different empirical methods leads to the corresponding competency question.\n</p>"
        },
        "title": "Number of empirical methods used for data analysis per year"
      },
      {
        "id": 3,
        "dataAnalysisInformation": {
          "question": "How has the proportion of papers that do not have an empirical study evolved over time?",
          "dataAnalysis": "For this data analysis, we select all papers that do not have an empirical study according to our definition (data collection and data analysis). For this reason, we only keep all papers that have \"no collection\" and/or \"no analysis\". For more detailed insights, we normalize the number of all papers without an empirical study based on the number of all unique papers per year, as the total number of papers per year varies.",
          "requiredDataForAnalysis": "<p>\n  We must retrieve all papers with their publication year that use our ORKG template and do not report an empirical study. \n  However, we need to define what we mean by an empirical study. According to the \n  <a href=\"https://www.springer.com/journal/10664\" target=\"_blank\">Empirical Software Engineering Journal</a>, \n  \"<em>Empirical studies presented here usually involve the collection and analysis of data and experience...</em>\". \n  For this reason, we define that an empirical study is a study that includes data analysis as a necessary condition to be a study \n  (<strong>Necessity</strong>) and data collection as a sufficient condition to be an empirical study (<strong>Sufficiency</strong>).\n</p>\n\n<p>\n  Thus, a study must always include data analysis and an empirical study must include both data collection and data analysis. \n  We do not consider the mere reporting of a data collection as a study or even an empirical study. \n  Therefore, we must retrieve all papers that do not have data collection, data analysis, or both.\n</p>",
          "dataInterpretation": "<p>Based on the figure and the following table, we observe a significant decline in the proportion of papers without an empirical studiy over time. The average proportion of papers without an empirical study decreased steadily over the decades indicating a clear shift toward including empirical studies in papers.</p>\n<p><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-c3ow{border-color:inherit;text-align:center;vertical-align:top}\n.tg .tg-7btt{border-color:inherit;font-weight:bold;text-align:center;vertical-align:center}\n.tg .tg-0pky{border-color:inherit;text-align:left;vertical-align:top}\n</style></p>\n<table class=\"tg\">\n<thead>\n<tr>\n<th class=\"tg-7btt\">Timeframe</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td class=\"tg-c3ow\">1993-1999</td>\n<td class=\"tg-c3ow\">51.4</td>\n<td class=\"tg-c3ow\">26-67</td>\n</tr>\n<tr>\n<td class=\"tg-c3ow\">2000-2009</td>\n<td class=\"tg-c3ow\">30.5</td>\n<td class=\"tg-c3ow\">14-41</td>\n</tr>\n<tr>\n<td class=\"tg-c3ow\">2010-2019</td>\n<td class=\"tg-c3ow\">14.8</td>\n<td class=\"tg-c3ow\">0-37</td>\n</tr>\n<tr>\n<td class=\"tg-c3ow\">2020-2025</td>\n<td class=\"tg-c3ow\">5.0</td>\n<td class=\"tg-c3ow\">0-12</td>\n</tr>\n</tbody>\n</table>\n\n<p>While the <strong>“current” state of practice (2007)</strong> shows an average proportion of papers without an empirical study of 21.0%, the proportion of papers without an empirical study in the <strong>target state (2020–2025)</strong> is consistently low (below 12.0%), with an average value of 5.0%. The data supports the vision by <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>. The proportion of papers without empirical studies has declined dramatically, reaching near-zero levels in the <strong>target state (2020–2025)</strong>. This suggests that the research community has largely adopted the practice of including empirical studies so that empirical studies have become the standard rather than the exception in empirical research in RE in recent years. </p><p>However, regarding the aspect that the papers should provide a good reason for <strong>not including a proper evaluation</strong>, further analysis is needed, as we have not yet examined how papers without empirical studies justify why they do not provide proper evaluation.</p>",
          "questionExplanation": "<p>\n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> \n  envision that there should be good reason for <strong>not including</strong> a proper evaluation. \n  This predicted state leads to the corresponding competency question.\n</p>"
        },
        "title": "Number of papers without an empirical study per year",
        "uid": "query_3"
      },
      {
        "id": 4,
        "title": "Number of empirical methods used for data analysis",
        "uid": "query_4_1",
        "dataAnalysisInformation": {
          "question": "How often are which empirical methods used?",
          "dataAnalysis": [
            "For this data analysis, we consider the empirical methods used for data collection. We identify the empirical methods used for data collection. A paper can involve more than one empirical method for data collection so that the number of empirical methods can be larger than the number of papers using empirical methods for data collection. We normalize the number of empirical methods used for data collection based on the number of all papers using at least one empirical methods for data collection.",
            "For this data analysis, we consider the empirical methods used for data analysis. We identify the empirical methods used for data analysis. A paper can involve more than one empirical method for data analysis so that the number of empirical methods can be larger than the number of papers using empirical methods for data analysis. We normalize the number of empirical methods used for data analysis based on the number of all papers using at least one empirical methods for data analysis."
          ],
          "requiredDataForAnalysis": "<p>\n  We must retrieve all papers that use our ORKG template and report on the use of empirical methods. \n  According to <a href=\"https://doi.org/10.1002/9781118901731.iecrm0083\" target=\"_blank\">Dan (2017)</a>, \n  empirical methods include data collection and data analysis. \n  An empirical method can therefore be a method for data collection and data analysis. \n  We consider the empirical method used for data collection or data analysis respectively, \n  as our template allows for a correspondingly more fine-grained analysis.\n</p>",
          "questionExplanation": "<p>\n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> \n  envision that researchers are trained in using a <strong>large set of research methods and techniques</strong>. \n  This predicted state leads to the corresponding competency question.\n</p>",
          "dataInterpretation": [
            "<p>Based on the figure, we observe that mainly seven empirical methods are used for data collection. These seven methods are <em>case study</em> (242 times), <em>experiment</em> (155 times), <em>survey</em> (116 times), <em>secondary research</em> (116 times), <em>interview</em> (110 times), <em>action research</em> (10 times), and <em>study</em> as a default category (229 times). <em>Case study</em> (24.7%) and <em>other method</em> as default category (23.4%) are most frequently used for data collection, with a very similar proportion. These methods are followed by <em>experiment</em> (15.8%), <em>survey</em> (11.9%), <em>secondary research</em> (11.9%), and <em>interview</em> (11.2%) that also have a very similar proportion and this play a significant role. Only <em>action research</em> is rarely used with a proportion of only 1.0% of all analyzed papers with a data collection, indicating a gap in its adoption.</p>\n<p>The data indicates that researchers use diverse empirical methods, including case studies, experiments, secondary research, surveys, and interviews, which demonstrates that researchers are increasingly trained in and applying a broad range of empirical methods, supporting the vision of <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>. However, the dominance of specific methods, such as case studies, suggests that while progress has been made, there is still potential to further diversify the empirical methods used in empirical research in RE.</p>",
            "<p>Based on the figure, we observe that mainly four empirical methods are used for data analysis. These four methods are <em>descriptive statistic</em> (671 times), <em>inferential statistic</em> (125 times), <em>machine learning</em> (153 times), and <em>other method</em> as a default category (579 times). Most frequently <em>descriptive statistic</em> is used with a proportion of 87% of all analyzed papers with a data analysis. <em>Other methods</em> are used second most frequently with a proportion of 65%. This large proportion requires further analysis in the future for more fine-grained insights. While <em>machine learning</em> is used in 20% of the analyzed papers, <em>inferential statistics</em>is used least frequently with a proportion of only 18%.</p>\n<p>Looking at the data as a whole, the vision by <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> is partially realized. The relatively low usage of machine learning and inferential statistics indicates that there may still be gaps in the adoption of more advanced or specialized empirical methods in empirical research in RE.</p>"
          ]
        }
      },
      {
        "id": 5,
        "uid": "query_5",
        "title": "Number of papers per yearNormalized number of empirical methods used for data collection per year",
        "dataAnalysisInformation": {
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>, the <strong>\"current\" state of practice (2007)</strong> shows that <strong>researchers are skilled</strong> (frequently use) <strong>experiments and reviews</strong> (secondary research), but <strong>researchers are not skilled</strong> (do not frequently use) <strong>surveys, case studies, and action research</strong>. For the <strong>target state (2020 - 2025)</strong>, <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> envision that researchers are trained in using a <strong>large set of research methods and techniques</strong> and that their <strong>skills</strong> (frequent use) <strong>of conducting case studies and action research are stimulated</strong>. This predicted change leads to the corresponding competency question.\n</p>",
          "question": "How have the proportions of experiments, secondary research (reviews), surveys, case studies, and action research in the empirical methods used evolved over time?",
          "dataAnalysis": "For this data analysis, we consider all papers that report on the use of the empirical methods: experiment, secondary research, survey, case study, action research. A paper can involve more than one empirical method for data collection so that the number of empirical methods can be larger than the number of papers. We normalize the number of empirical methods (experiment, secondary research, survey, case study, action research) used based on the number of all unique papers per year.",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and report on the use of the empirical methods: experiments, secondary reserach (reviews), surveys, case studies, and action research.",
          "dataInterpretation": "<p>Based on the figure and the following table, we observe the following trends for the five empirical methods for data collection.</p>\n<p><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-c3ow{border-color:inherit;text-align:center;vertical-align:top}\n.tg .tg-7btt{border-color:inherit;font-weight:bold;text-align:center;vertical-align:center}\n.tg .tg-0pky{border-color:inherit;text-align:left;vertical-align:top}\n</style></p>\n<table class=\"tg\">\n<thead>\n<tr>\n<th class=\"tg-7btt\" rowspan=\"2\">Timeframe</th>\n<th class=\"tg-7btt\" colspan=\"2\">Experiment</th>\n<th class=\"tg-7btt\" colspan=\"2\">Case study</th>\n<th class=\"tg-7btt\" colspan=\"2\">Secondary research</th>\n<th class=\"tg-7btt\" colspan=\"2\">Survey</th>\n<th class=\"tg-7btt\" colspan=\"2\">Action research</th>\n</tr>\n<tr>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n<th class=\"tg-7btt\">Avg. proportion [%]</th>\n<th class=\"tg-7btt\">Range [%]</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td class=\"tg-0pky\">1993-1999</td>\n<td class=\"tg-c3ow\">9.1</td>\n<td class=\"tg-c3ow\">0-21</td>\n<td class=\"tg-c3ow\">50.6</td>\n<td class=\"tg-c3ow\">12-78</td>\n<td class=\"tg-c3ow\">12.1</td>\n<td class=\"tg-c3ow\">0-30</td>\n<td class=\"tg-c3ow\">11.6</td>\n<td class=\"tg-c3ow\">0-23</td>\n<td class=\"tg-c3ow\">0.0</td>\n<td class=\"tg-c3ow\">0</td>\n</tr>\n<tr>\n<td class=\"tg-0pky\">2000-2009</td>\n<td class=\"tg-c3ow\">16.0</td>\n<td class=\"tg-c3ow\">0-39</td>\n<td class=\"tg-c3ow\">53.0</td>\n<td class=\"tg-c3ow\">44-67</td>\n<td class=\"tg-c3ow\">11.5</td>\n<td class=\"tg-c3ow\">5-17</td>\n<td class=\"tg-c3ow\">14.0</td>\n<td class=\"tg-c3ow\">0-28</td>\n<td class=\"tg-c3ow\">3.0</td>\n<td class=\"tg-c3ow\">0-10</td>\n</tr>\n<tr>\n<td class=\"tg-0pky\">2010-2019</td>\n<td class=\"tg-c3ow\">36.4</td>\n<td class=\"tg-c3ow\">21-56</td>\n<td class=\"tg-c3ow\">34.1</td>\n<td class=\"tg-c3ow\">6-53</td>\n<td class=\"tg-c3ow\">17.0</td>\n<td class=\"tg-c3ow\">0-29</td>\n<td class=\"tg-c3ow\">21.0</td>\n<td class=\"tg-c3ow\">11-35</td>\n<td class=\"tg-c3ow\">1.6</td>\n<td class=\"tg-c3ow\">0-5</td>\n</tr>\n<tr>\n<td class=\"tg-0pky\">2020-2025</td>\n<td class=\"tg-c3ow\">34.8</td>\n<td class=\"tg-c3ow\">15-57</td>\n<td class=\"tg-c3ow\">20.5</td>\n<td class=\"tg-c3ow\">12-40</td>\n<td class=\"tg-c3ow\">41.5</td>\n<td class=\"tg-c3ow\">35-50</td>\n<td class=\"tg-c3ow\">25.8</td>\n<td class=\"tg-c3ow\">14-43</td>\n<td class=\"tg-c3ow\">0.0</td>\n<td class=\"tg-c3ow\">0</td>\n</tr>\n</tbody>\n</table>\n\n<p>First, we will briefly summarize our observations for each empirical method before looking at the data as a whole.</p>\n<p>1) <em>Experiment</em>: Experiments show a gradual increase in popularity over time, becoming more widely used after 2007. For the <strong>&quot;current&quot; state of practice (2007)</strong>, experiments are only used in 8.0% of papers analyzed, reflecting low adoption. Their use peaked at 57.0% in 2022, demonstrating a growing interest in this empirical method. For the <strong>target state (2020 - 2025)</strong>, experiments are established as a key method, with an average proportion of 34.8%, highlighting their enduring importance in empirical research in RE.</p>\n<p>2) <em>Case study</em>: Over the years, case studies are the dominant empirical method, especially in the early period, peaking at 78.0% in 1996. However, their use declines steadily after 2012. For the <strong>&quot;current&quot; state of practice (2007)</strong>, case studies are still the most common empirical method overall, used in 54.0% of papers analyzed, but their dominance is already decreasing. For the <strong>target state (2020 - 2025)</strong>, the average proportion of case studies drops significantly to 20.5%, indicating a major shift away from this method toward other empirical methods. </p>\n<p>We assume this change is a result of a clear definition of the term case study. According to <a href=\"https://doi.org/10.1016/j.infsof.2021.106514\">Wohlin</a>, the term case study is often misused in software engineering research. Based on the manual curation of the 776 papers, we can confirm this finding. Prior to 2013, we found many papers that use the term case study (with an average proportion of 51.9%), although at best they report an experiment or a larger use case in the sense of an application example. Despite the decrease, this finding represents a positive development of the empirical research in RE as researchers appear to be more aware of how a case study is defined.</p>\n<p>3) <em>Secondary research</em>: Secondary research, including all kinds of literature reviews and archive analysis, show a clear rise from 2015 onward, becoming one of the most popular empicial methods by 2022. For the <strong>&quot;current&quot; state of practice (2007)</strong>, it was rarely used, with an proportion of just 12.0%. However, its use surged in the <strong>target state (2020 - 2025)</strong> with an average proportion of 41.5% and its peak at 50.0% in 2022. This trend highlights the increasing value of analyzing existing data in empirical research in RE.</p>\n<p>4) <em>Survey</em>: Surveys maintained a relatively stable throughout the years, with minor fluctuations. For the <strong>&quot;current&quot; state of practice (2007)</strong>, they were used in only 8.0% of the papers analyzed, indicating limited adoption at the time. However, their use increased steadily in recent years, reaching an average proportion of 25.8% for the <strong>target state (2020 - 2025)</strong>. This suggests a growing preference for structured data collection through surveys, reflecting their consistent role in empirical research in RE.</p>\n<p>5) <em>Action research</em>: Action research remains consistently low throughout the entire analyzed timeframe (1993-2025). For the <strong>&quot;current&quot; state of practice (2007)</strong>, it was used with a proportion of 8.0%. After 2017, and thus also for the <strong>target state (2020 - 2025)</strong>, there is no paper using action research. It remains a niche method, indicating limited adoption in empirical research in RE.</p>\n<p>The data reveals a mixed picture when compared to the vision by <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>. On one hand, the continued prominence of experiments and the growing use of secondary research align well with their prediction that researchers maintain and expand their skills in these areas. Surveys also saw a notable increase, suggesting some progress toward broadening researchers’ methodological skills. However, the vision of stimulating greater use of case studies and action research has not materialized. Case studies, despite being widely used in the early years, have seen a steady decline. Although this decline does not fundamentally help achieving the vision of <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, we believe this change nonetheless represents a positive development in empirical research in RE, as researchers appear to be more aware of how the term case study is defined. Action research remains negligible throughout the entire analyzed time frame. This discrepancy regarding case studies and action research highlights a gap between the envisioned <strong>target state (2020 - 2025)</strong> and the actual evolution of research practices, indicating that additional efforts may be needed to foster these underutilized methods in empirical research in RE.</p>"
        }
      },
      {
        "id": 6,
        "title": "Number of statistical methods of descriptive statistics used for data analysis",
        "uid": "query_6_1",
        "dataAnalysisInformation": {
          "question": "How often are which statistical methods used?",
          "dataAnalysis": "For this data analysis, we consider the statistical methods of descriptive statistics used for data analysis. We identify the statistical methods of descriptive statistics used for data analysis. A paper can involve more than one statistical methods of descriptive statistics used for data analysis so that the number of statistical methodsof descriptive statistics used for data analysis can be larger than the number of papers using empricial methods for data analysis. We normalize the number of statistical methods of descriptive statistics used for data analysis based on the number of all papers using at least one empirical method for data analysis.",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>, the <strong>\"current\" state of practice (2007)</strong> shows that <strong>statistical methods are used mechanically, and with little knowledge about limitations and assumptions</strong>. For the <strong>target state (2020 - 2025)</strong>, <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> envision that <strong>the use of statistical methods is mature</strong>. This predicted change leads to the corresponding competency question.\n</p>",
          "dataInterpretation": [
            "<p>\n  Based on the figure \"Normalized number of statistical methods of descriptive statistics used for data analysis\", we observe that ten out of twelve statistical methods of descriptive statistics are used for data analysis. These ten methods are <em>count</em> (390 times), <em>percent</em> (266 times), <em>mean</em> (194 times), <em>range</em> (110 times), <em>minimum</em> (56 times), <em>standard deviation</em> (53 times), <em>median</em> (49 times), <em>maximum</em> (47 times), <em>boxplot</em> (43 times), <em>variance</em> (7 times), and <em>mode</em> (3 times). Most frequently the analyzed papers report <em>count</em> with a proportion of 86%, followed by <em>percent</em> with a proportion of 59%, <em>mean</em> with a proportion of 43%, and <em>range</em> with a proportion of at least 24%. These results show that researchers mainly report absolute (<em>count</em>) and relative (<em>percent</em>) values as well as averages. While they also report ranges occasionally, most other statistical methods of descriptive statistics are rarely used as they have a maximum proportion of 12% of the papers analyzed.\n</p>\n",
            "<p>\n  Based on the figure \"Number and Normalized number of statistical methods of inferential statistics used for data analysis\", we see that 57 statistical tests are reported in the 570 papers analyzed. A closer look at the names of the statistical tests extracted from the papers shows that there seems to be a large number of different spellings for partly the same test, such as the Mann-Whitney-U-test with 6 different spellings. Unfortunately, most papers do not provide a reference with which it could be determined more precisely whether all the different spellings really always refer to the same test. Overall, the maximum proportion of the most frequently used statistical tests (Wilcoxon signed rank test and Shapiro-Wilk test) is 2.9%. Thus, the application of statistical methods of inferential statistics seems to be, on the one hand, rather low and, on the other hand, very diverse.\n</p>\n\n<p>\n  The results indicate that the envisioned use of statistical methods is not yet mature, as the overall and individual proportion of statistical tests is rather low and researchers already struggle with the consistent use of uniform names for the statistical tests applied.\n</p>"
          ],
          "requiredDataForAnalysis": "We must retrieve all papers that use our ORKG template and report on the use of the statistical methods: descriptive statistics and inferential statistics. We consider each of these two types of statistics separately, as our template allows for a correspondingly more fine-grained analysis."
        }
      },
      {
        "id": 7,
        "title": "Number of papers per year",
        "uid": "query_7_1",
        "dataAnalysisInformation": {
          "dataAnalysis": "For this data analysis, we consider the statistical methods of descriptive statistics used for data analysis. We identify the statistical methods of descriptive statistics used for data analysis. A paper can involve more than one statistical methods of descriptive statistics used for data analysis so that the number of statistical methodsof descriptive statistics used for data analysis can be larger than the number of papers using empricial methods for data analysis. We normalize the number of statistical methods of descriptive statistics used for data analysis based on the number of all papers using at least one empirical method for data analysis.",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>, the <strong>\"current\" state of practice (2007)</strong> shows that <strong>statistical methods are used mechanically, and with little knowledge about limitations and assumptions</strong>. For the <strong>target state (2020 - 2025)</strong>, <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> envision that <strong>the use of statistical methods is mature</strong>. This predicted change leads to the corresponding competency question.\n</p>",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and report on the use of the statistical methods: descriptive statistics and inferential statistics. We consider each of these two types of statistics separately, as our template allows for a correspondingly more fine-grained analysis.",
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of statistical methods of descriptive statistics used for data analysis per year grouped by statistical method\", we observe that ten out of twelve statistical methods of descriptive statistics are used for data analysis. These ten methods are <em>count</em> (390 times), <em>percent</em> (266 times), <em>mean</em> (194 times), <em>range</em> (110 times), <em>minimum</em> (56 times), <em>standard deviation</em> (53 times), <em>median</em> (49 times), <em>maximum</em> (49 times), <em>boxplot</em> (43 times), <em>variance</em> (7 times), and <em>mode</em> (3 times). While the statistical methods of descriptive statistics <em>count</em>, <em>percent</em>, and <em>mean</em> are most frequently used compared to the other statistical methods of descriptive statistics, we observe that each method itself is more or less constantly used over time.\n</p>\n\n<p>\n  Based on the table \"Number and Normalized number of statistical methods of inferential statistics used for data analysis\", we see that the use of statistical tests of inferential statistics is very diverse due to the large number of 57 statistical tests (different based on their reported names).\n</p>\n\n<p>\n  Overall, there is no clear trend that a mature use of statistical methods has emerged over time, especially not for the <strong>target state (2020 - 2025)</strong> so far.\n</p>",
          "question": "How has the use of statistical methods evolved over time?"
        }
      },
      {
        "id": 8,
        "uid": "query_8",
        "title": "Number of papers per year",
        "dataAnalysisInformation": {
          "questionExplanation": "<p>\n  According to \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a>, \n  the <strong>\"current\" state of practice (2007)</strong> shows that researchers \n  <strong>lack knowledge about limitations and assumptions of statistical tests, power analysis and effect size estimation as well as do not well define populations</strong>. \n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> envision that \n  <strong>all these aspects are sufficiently addressed</strong>. \n  All mentioned aspects relate to threats to validity of an empirical study, and this predicted change leads to the corresponding competency question.\n</p>",
          "dataAnalysis": "For this data analysis, we select all papers that report threats to validity. For more detailed insights, we normalize the number of all papers reporting threats to validity based on the number of all unique papers per year, as the total number of papers per year varies.",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and report on threats to validity.",
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of papers reporting threats to validity per year\", an increasing proportion of papers reporting threats to validity can be observed over time. \n  While before 2010 the average proportion of papers reporting threats to validity is 17.5%, the average proportion for the period 2010 - 2019 is 72%. \n  For the <strong>target state (2020 - 2025)</strong>, the average proportion of papers reporting threats to validity is 91.3%. \n  Based on these data, we observe a positive development towards the vision of \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\" target=\"_blank\">Sjøberg et al. (2007)</a> \n  that researchers sufficiently address threats to validity as envisioned for the <strong>target state (2020 - 2025)</strong>.\n</p>",
          "question": "How has the reporting of threats to validity evolved over time?"
        }
      },
      {
        "id": 9,
        "title": "Number of papers per year",
        "uid": "query_9",
        "dataAnalysisInformation": {
          "dataInterpretation": "<p>\n  Based on the figure \"Normalized number of threats to validity reported in papers\", we observe that mainly ten different types of validity are reported in all 570 papers analyzed. \n  <em>External</em> (60.4% proportion), <em>internal</em> (56.1% proportion), and <em>construct</em> (47.9% proportion) validity are reported most frequently. \n  All other types of validity have a proportion below 20%. It is striking that <em>conclusion</em> validity has only a proportion of 18.2%. \n  Even if we consider the type <em>reliability</em> as a synonym of <em>conclusion</em> validity and add the proportions together, we still get a proportion of only 28.9%. \n  In this regard, the reporting of threats to validity seems to be unbalanced as frequently researchers do not address the conclusion validity of their findings. \n  In addition, we found that 33.6% of the papers analyzed that report validity threats simply mention threats to validity without further classification of the types of validity addressed. \n  This lack of classification makes it difficult for the reader to easily assess whether the validity of the findings has been extensively discussed.\n</p>\n\n<p>\n  Overall, the results show that researchers mainly deal with the <em>external</em>, <em>internal</em>, and <em>construct</em> validity of their findings. \n  Although a positive development towards a sufficient addressing of threats to validity as envisioned in the vision of \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> can be seen, a better consideration of the <em>conclusion</em> validity is necessary \n  for a comprehensive consideration of threats to validity. Furthermore, while it is good that researchers report more and more threats to validity, \n  a classification of the threats to validity reported is particularly helpful for the reader to determine whether the validity of the results has been extensively discussed.\n</p>",
          "dataAnalysis": "For this data analysis, we select all papers that report threats to validity. For more detailed insights, we normalize the number of all papers reporting threats to validity based on the number of all unique papers per year, as the total number of papers per year varies.",
          "requiredDataForAnalysis": "We must retrieve all papers with their publication year that use our ORKG template and report on threats to validity.",
          "questionExplanation": "<p>\n  According to <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a>, \n  the <strong>\"current\" state of practice (2007)</strong> shows that researchers \n  <strong>lack knowledge about limitations and assumptions of statistical tests, power analysis and effect size estimation as well as do not well define populations</strong>.\n  For the <strong>target state (2020 - 2025)</strong>, \n  <a href=\"https://doi.org/10.1109/FOSE.2007.30\">Sjøberg et al. (2007)</a> envision that \n  <strong>all these aspects are sufficiently addressed</strong>.\n  All mentioned aspects relate to threats to validity of an empirical study, and this predicted change leads to the corresponding competency question.\n</p>",
          "question": "What types of threats to validity do the authors report?"
        }
      }
    ],
    "Questions Nlp4re": [
      {
        "id": 1,
        "uid": "query_1",
        "title": "What are top-3 most frequently used evaluation metrics to assess a developed NLP approach?"
      },
      {
        "id": 2,
        "uid": "query_2",
        "title": " Which papers are associated with annotation guidelines?"
      }
    ],
    "Statistics": [
      {
        "id": "empire-statistics",
        "global_distinct_literals": 13569,
        "updatedAt": "2025-10-23T19:22:39.923177+00:00",
        "global_distinct_predicates": 196,
        "global_distinct_resources": 9033,
        "total_literals": 28774,
        "total_resources": 67756,
        "total_predicates": 48265,
        "total_statements": 48265
      },
      {
        "id": "general_statistics",
        "statements": 47466,
        "distinctResources": 8088,
        "predicates": 47466,
        "distinctLiterals": 5251,
        "literals": 28307,
        "distinctPredicates": 196,
        "resources": 66625
      }
    ],
    "Templates": [
      {
        "id": "Empirical Research Practice",
        "templateID": "R186491"
      },
      {
        "id": "NLP4RE",
        "templateID": "R1544125"
      }
    ],
    "Users": [
      {
        "id": "01bfb370-824d-4848-a434-4e465720a36a",
        "observatory_id": null,
        "email": "amirrezaalasti@gmail.com",
        "display_name": "Amirreza Alasti",
        "is_curation_allowed": false,
        "organization_id": null,
        "created_at": "2024-10-20T18:42:34.293536+02:00",
        "is_admin": true
      },
      {
        "id": "7adcfc45-b315-4df7-b9a5-010e8f1ca9cb",
        "display_name": "Oliver Karras",
        "organization_id": "edc18168-c4ee-4cb8-a98a-136f748e912e",
        "created_at": "2021-04-19T10:10:31.696138+02:00",
        "email": "oliver.karras@tib.eu",
        "is_curation_allowed": true,
        "observatory_id": "ae6d3307-fcda-4d8c-9c24-d1e2d6db91f2"
      }
    ]
  }
}
